In [1]:
import pandas as pd

In [2]:
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

### Selecting one column

### Option 1

In [4]:
# select a column with [] (preferred way to select a column)
df_exams['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [8]:
# this is a 1d array a.k.a Serie

# check out the data type of a column
type(df_exams['gender'])

pandas.core.series.Series

In [7]:
# and series (columns), just like dfs, have attributes and methods. So we can access them

In [9]:
# series: attributes and methods
df_exams['gender'].index

RangeIndex(start=0, stop=1000, step=1)

In [10]:
# And also we can get rows of a series
df_exams['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

### Option 2

In [11]:
# Select a column with .
df_exams.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [15]:
# This syntax has some pitfalls (algunas trampas)

# what if you want to get a column whose name has two words?
# for example, 'math score', we cannot get that column by executing df_exams.math score 
# because it is not allowed. Python doesn't work like that. So in that case we should use the 1st syntax.

In [16]:
# Select the same column using []
df_exams['math score']

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64

In [17]:
# So this is one of the advantages that square brackets has over the dot syntax.